describe("test", function() {

   // Зазвичай Mocha очікує 2 секунди, щоб завершилися тести, перш ніж вважати їх неправильними

  this.timeout(200000); // Цим кодом ми збільшуємо час очікування - до 200 000 мілісекунд

  // Збільшуємо час через те, що виконується функція "alert": у випадку, коли довго не натискати кнопку "OK", тест провалиться!

  before(() => alert("Тестування розпочато – перед усіма тестами"));
  after(() => alert("Тестування завершено – після всіх тестів"));

  beforeEach(() => alert("Перед тестом – початок тесту"));
  afterEach(() => alert("Після тесту – вихід з тесту"));

  it('test 1', () => alert(1));
  it('test 2', () => alert(2));

});
